Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `quarkus.oidc.authentication.user-info-required` is enabled automatically if it is detected that the Quarkus endpoint has `quarkus.oidc.UserInfo` injected - you `do not have to enable` this property in this case.
ja_jp: `quarkus.oidc.authentication.user-info-required` は、Quarkus エンドポイントに `quarkus.oidc.UserInfo` が注入されていることが検出されると自動的に有効になります。この場合、このプロパティーを `明示的に有効にする必要はありません`。

source: `quarkus.oidc.authorization-path`, `quarkus.oidc.token-path` and `quarkus.oidc.end-session-path` are only relevant when the <<authorization-code-flow> authentication is enabled with `quarkus.oidc.application-type=web-app`.
ja_jp: `quarkus.oidc.authorization-path` 、 `quarkus.oidc.token-path` 、および `quarkus.oidc.end-session-path` は、 `quarkus.oidc.application-type=web-app` で <<authorization-code-flow>> 認証が有効な場合にのみ関連します。

source: `quarkus.oidc.cache-user-info-in-idtoken` is a possible cache optimization option when you work with OAuth2 providers, when an internal ID token is generated and encrypted in the session cookie. In this case, the UserInfo JSON can be saved directly in the generated ID token, before it is encrypted, avoiding the need for keeping the server-side `UserInfo` cache.
ja_jp: `quarkus.oidc.cache-user-info-in-idtoken` は、セッションクッキー内で内部 ID トークンが生成され暗号化される OAuth2 プロバイダーを使用する場合に利用可能なキャッシュ最適化オプションです。この場合、UserInfo の JSON を暗号化前の生成された ID トークンに直接保存できるため、サーバー側で `UserInfo` キャッシュを保持する必要がなくなります。

source: `quarkus.oidc.certificate-chain.leaf-certificate-name` can also require that the trustore contains a leaf chain certificate.
ja_jp: `quarkus.oidc.certificate-chain.leaf-certificate-name` は、トラストストアにリーフチェーン証明書が含まれていることを要求することもできます。

source: `quarkus.oidc.certificate-chain.trust-store-cert-alias` can be used to select a specific certificate to match the token's certificate chain root certificate.
ja_jp: `quarkus.oidc.certificate-chain.trust-store-cert-alias` を使用して、トークンの証明書チェーンのルート証明書に一致する特定の証明書を選択できます。

source: `quarkus.oidc.certificate-chain.trust-store-file` must be available and point to the file containing `at least` a root certificate. `quarkus.oidc.certificate-chain.trust-store-password` and `quarkus.oidc.certificate-chain.trust-store-file-type` can be used to facilitate access to this truststore.
ja_jp: `quarkus.oidc.certificate-chain.trust-store-file` が利用可能であり、 `少なくとも` ルート証明書を含むファイルを指している必要があります。このトラストストアへのアクセスを容易にするために、 `quarkus.oidc.certificate-chain.trust-store-password` および `quarkus.oidc.certificate-chain.trust-store-file-type` を使用できます。

source: `quarkus.oidc.client-id` and `quarkus.oidc.credentials.secret` can be used to customize the client id and secret.
ja_jp: `quarkus.oidc.client-id` と `quarkus.oidc.credentials.secret` を使用して、クライアント ID とシークレットをカスタマイズできます。

source: `quarkus.oidc.client-id` property identifies an OpenID Connect Client which requested the current bearer token. It can be an SPA application running in a browser or a Quarkus `web-app` confidential client application propagating the access token to the Quarkus `service` application.
ja_jp: `quarkus.oidc.client-id` プロパティーは、現在のBearer Tokenを要求した OpenIDConnect クライアントを識別します。これは、ブラウザーで実行されている SPA アプリケーション、またはアクセストークンを Quarkus `service` アプリケーションに伝播する Quarkus `web-app` 機密クライアントアプリケーションの場合があります。

source: `quarkus.oidc.client-id` sets a client id that identifies the application.
ja_jp: `quarkus.oidc.client-id` は、アプリケーションを識別するクライアント ID を設定します。

source: `quarkus.oidc.client-name` is a user-friendly client name and is currently only used to make the log messages more informative.
ja_jp: `quarkus.oidc.client-name` はユーザーフレンドリーなクライアント名であり、現在はログメッセージの情報をより充実させるためにのみ使用されます。

source: `quarkus.oidc.code-grant.extra-params` is a map property which can be used to set additional parameters that must be sent to the OIDC token endpoint to complete the authorization code flow, after the user authenticated and got redirected to Quarkus with the authorization `code`. Often, this `code` and the `redirect_uri` which must match the one included in the initial authorization code flow redirect are sent as form parameters, in addition to the client authentication credentials.
ja_jp: `quarkus.oidc.code-grant.extra-params` は、ユーザーが認証され認可 `code` を持って Quarkus にリダイレクトされた後、認可コードフローを完了するために OIDC トークンエンドポイントに送信する必要がある追加パラメーターを設定するためのマップ設定プロパティーです。多くの場合、この `code` と、初期認可コードフローのリダイレクトに含まれていたものと一致する必要がある `redirect_uri` は、クライアント認証クレデンシャルに加えて、フォームパラメーターとして送信されます。

source: `quarkus.oidc.connection-retry-count` sets a number of connection retries and `quarkus.oidc.connection-time-out` sets a duration after which the current OIDC connection request times out. `quarkus.oidc.connection-delay` establishes a delay for an initial connection request only.
ja_jp: `quarkus.oidc.connection-retry-count` は接続の再試行回数を設定し、 `quarkus.oidc.connection-time-out` は現在の OIDC 接続リクエストがタイムアウトするまでの時間を設定します。 `quarkus.oidc.connection-delay` は、初回接続リクエストのみに遅延を設定します。

source: `quarkus.oidc.credentials.jwt.key-store-file`, `quarkus.oidc.credentials.jwt.key-store-password`, `quarkus.oidc.credentials.jwt.key-id` and `quarkus.oidc.credentials.jwt.key-password` can be used to extract the private key from a keystore.
ja_jp: `quarkus.oidc.credentials.jwt.key-store-file` 、 `quarkus.oidc.credentials.jwt.key-store-password` 、 `quarkus.oidc.credentials.jwt.key-id` 、および `quarkus.oidc.credentials.jwt.key-password` を使用して、キーストアから秘密鍵を抽出できます。

source: `quarkus.oidc.credentials.jwt.key` contains an inlined Base64-encoded private key representation, and is especially useful when you need to supply it as an environment property. `quarkus.oidc.credentials.jwt.key-file` point to a PEM file containing the private key.
ja_jp: `quarkus.oidc.credentials.jwt.key` は、インライン化された Base64 エンコードの秘密鍵表現を含み、特に環境プロパティーとして提供する必要がある場合に便利です。 `quarkus.oidc.credentials.jwt.key-file` は秘密鍵を含む PEM ファイルを指します。

source: `quarkus.oidc.credentials.jwt.token-key-id` can be used to set a key identifier (`kid`) header value to help the OIDC provider with fidning a token verification key. All other properties listed in the table above can be used to customize JWT claim values.
ja_jp: `quarkus.oidc.credentials.jwt.token-key-id` を使用してキー識別子 (`kid`) ヘッダー値を設定し、OIDC プロバイダーがトークン検証キーを見つけるのを助けることができます。上記の表に記載されている他のすべてのプロパティーは、JWT クレーム値のカスタマイズに使用できます。

source: `quarkus.oidc.credentials.secret` sets the client secret, which is used by the `client_secret_basic` authentication method.
ja_jp: `quarkus.oidc.credentials.secret` は、`client_secret_basic` 認証方法で使用されるクライアントシークレットを設定します。

source: `quarkus.oidc.introspection-credentials.name` and `quarkus.oidc.introspection-credentials.secret` must be used only if your provider requires the introspection specific authentication credentials. In this case, the introspection endpoint may also require a `quarkus.oidc.client-id` property sent as a `client_id` parameter.
ja_jp: `quarkus.oidc.introspection-credentials.name` と `quarkus.oidc.introspection-credentials.secret` は、プロバイダーがイントロスペクション固有の認証クレデンシャルを必要とする場合にのみ使用する必要があります。この場合、イントロスペクションエンドポイントは `client_id` パラメーターとして送信される `quarkus.oidc.client-id` プロパティーも必要とする場合があります。

source: `quarkus.oidc.introspection-path` is required in most cases when an opaque (binary) access token must be introspected remotely because such tokens can not have attached signatures that can be verified. It is worth setting `quarkus.oidc.introspection-path` even if you work with JWT tokens and your provider supports the remote token introspection. In such cases, JWT tokens can be introspected remotely as a fallback, when no matching JWK verification key has been found to verify JWT locally.
ja_jp: 不透明な (バイナリ) アクセストークンをリモートでイントロスペクションする必要がある場合、そのようなトークンには検証可能な署名が付加されていないため、ほとんどの場合 `quarkus.oidc.introspection-path` が必要になります。 JWT トークンを扱う場合でも、プロバイダーがリモートイントロスペクションをサポートしているなら、 `quarkus.oidc.introspection-path` を設定する価値があります。そのような場合、 JWT をローカルで検証するための一致する JWK 検証キーが見つからないときに、フォールバックとして JWT トークンをリモートでイントロスペクションできます。

source: `quarkus.oidc.jwks-path` is needed to fetch JSON Web Key Set (JWKS) but only if the tokens are JSON Web Tokens (JWT). When it is `quarkus.oidc.application-type=web-app`, ID tokens representing the user authentication are always in JWT format, and in most cases JWK keys are needed to verify them. The JWKS path is not needed if you work with opaque (binary) bearer access tokens which are usually remotely introspected instead.
ja_jp: `quarkus.oidc.jwks-path` は JSON Web Key Set (JWKS) を取得するために必要ですが、これはトークンが JSON Web Token (JWT) である場合に限られます。 `quarkus.oidc.application-type=web-app` の場合、ユーザー認証を表す ID トークンは常に JWT 形式であり、ほとんどの場合、それらを検証するために JWK キーが必要になります。通常はリモートでイントロスペクションされる不透明な (バイナリ) ベアラーアクセストークンを扱う場合は、 JWKS パスは必要ありません。

source: `quarkus.oidc.logout.backchannel.path` is a relative path the OIDC provider must send the back-channel logout notifications to.
ja_jp: `quarkus.oidc.logout.backchannel.path` は、OIDC プロバイダーがバックチャネルログアウト通知を送信する必要がある相対パスです。

source: `quarkus.oidc.logout.backchannel.token-cache-size`, `quarkus.oidc.logout.backchannel.token-cache-time-to-live` and `quarkus.oidc.logout.backchannel.clean-up-timer-interval` are properties for managing the back-channel notification cache.
ja_jp: `quarkus.oidc.logout.backchannel.token-cache-size`、 `quarkus.oidc.logout.backchannel.token-cache-time-to-live`、および `quarkus.oidc.logout.backchannel.clean-up-timer-interval` は、バックチャネル通知キャッシュを管理するためのプロパティーです。

source: `quarkus.oidc.logout.frontchannel.path` is a secure path where the browser will send the front-channel logout request to.
ja_jp: `quarkus.oidc.logout.frontchannel.path` は、ブラウザーがフロントチャネルログアウトリクエストを送信する保護されたパスです。

source: `quarkus.oidc.logout.path` is a relative path where a user logout request should be sent to. For example, given `quarkus.oidc.logout.path=/logout`, a `Logout` link in the SPA page can point to `http://localhost:8080/logout`. This path can be virtual, you do not have to create a JAX-RS endpoint or route handler listening on `/logout`. But for the `quarkus.oidc.logout.path` be effective, it must be secured, see the https://quarkus.io/guides/security-oidc-code-flow-authentication#user-initiated-logout[User-initiated logout] section for more details.
ja_jp: `quarkus.oidc.logout.path` は、ユーザーのログアウトリクエストの送信先となる相対パスです。たとえば、 `quarkus.oidc.logout.path=/logout` と設定した場合、SPA ページの `Logout` リンクの宛先を `http://localhost:8080/logout` にできます。このパスは仮想的なものでもよく、 `/logout` でリッスンする JAX-RS エンドポイントやルートハンドラーを作成する必要はありません。ただし、 `quarkus.oidc.logout.path` を有効にするには保護されている必要があるため、詳細は https://quarkus.io/guides/security-oidc-code-flow-authentication#user-initiated-logout[ユーザー主導型ログアウト] セクションを参照してください。

source: `quarkus.oidc.logout.post-logout-path` points to a public endpoint where you would like the provider redirect the looged-out user to. For example, the logged out user can be returned to the application's welcome page with `quarkus.oidc.logout.post-logout-path=/welcome.html` where this user can choose to login again. For the post logout redirect to work, OIDC providers usually require registering absolute post logout URLs such as `http://localhost:8080/welcome.html`. Please do not forget, it must be a public endpoint, otherwise the user will be requested to login immediately after choosing to logout.
ja_jp: `quarkus.oidc.logout.post-logout-path` は、ログアウトしたユーザーをプロバイダーがリダイレクトさせる公開エンドポイントを指します。たとえば、 `quarkus.oidc.logout.post-logout-path=/welcome.html` と設定して、ログアウトしたユーザーをアプリケーションのウェルカムページに戻し、そこで再度ログインを選択できるようにすることが可能です。ログアウト後のリダイレクトを機能させるには、通常 OIDC プロバイダー側で `http://localhost:8080/welcome.html` のような絶対パスのログアウト後 URL を登録する必要があります。このパスは必ず公開エンドポイントである必要があることに注意してください。そうでない場合、ユーザーはログアウトを選択した直後に再度ログインを求められることになります。

source: `quarkus.oidc.logout.post-logout-uri-param` and `quarkus.oidc.logout.extra-params` can be used to customize the RP-initiated logout query parameters, for example, Auth0 might expect Auth0-specific logout query parameters, see the https://quarkus.io/guides/security-oidc-code-flow-authentication#user-initiated-logout[User-initiated logout] section for more details.
ja_jp: `quarkus.oidc.logout.post-logout-uri-param` と `quarkus.oidc.logout.extra-params` を使用して、RP-initiated ログアウトのクエリーパラメーターをカスタマイズできます。たとえば Auth0 では、Auth0 固有のログアウトクエリーパラメーターが必要になる場合があります。詳細は https://quarkus.io/guides/security-oidc-code-flow-authentication#user-initiated-logout[ユーザー主導型ログアウト] セクションを参照してください。

source: `quarkus.oidc.provider=apple` will request Apple to add `openid`, `email` and `name` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=Apple` は、発行されたアクセストークンに `openid`、 `email`、 `name` スコープを追加するように Apple に要求します。これらのスコープをオーバーライドしたり、さらにスコープを要求する方法は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=facebook` will request Facebook to add `email` and `public_profile` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=facebook` は、発行されたアクセストークンに `email` および `public_profile` スコープを追加するよう Facebook に要求します。これらのスコープを上書きしたり、さらにスコープを要求したりする方法の詳細は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=github` will request GitHub to add a `user:email` scope to issued access tokens. For information about overriding this scope or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=github` は、発行されたアクセストークンに `user:email` スコープを追加するよう GitHub に要求します。このスコープをオーバーライドしたり、さらにスコープを要求したりする方法の詳細は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=google` will request Google to add `openid`, `email` and `profile` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=google` は、発行されたアクセストークンに `openid`、 `email`、 `profile` スコープを追加するよう Google に要求します。これらのスコープをオーバーライドしたり、さらにスコープを要求したりする方法の詳細は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=microsoft` will request Microsoft to add `openid`, `email` and `profile` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=microsoft` は、発行されたアクセストークンに `openid`、 `email`、 `profile` スコープを追加するよう Microsoft に要求します。これらのスコープをオーバーライドしたり、さらにスコープを要求したりする方法の詳細は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=spotify` will request Spotify to add `user-read-private` and `user-read-email` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=spotify` は、Spotify に発行されたアクセストークンに `user-read-private` および `user-read-email` スコープを追加するよう要求します。これらのスコープをオーバーライドしたり、さらにスコープを要求したりする方法の詳細は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider=x` will request X to add `offline.access`, `tweet.read` and `users.read` scopes to issued access tokens. For information about overriding these scopes or requesting more scopes, see the <<provider-scope>> section.
ja_jp: `quarkus.oidc.provider=x` は、発行されたアクセストークンに `offline.access`、 `tweet.read`、 `users.read` スコープを追加するよう X に要求します。これらのスコープをオーバーライドしたり、さらにスコープを要求したりする方法は、<<provider-scope>> セクションを参照してください。

source: `quarkus.oidc.provider` configuration property has been introduced to refer to well-known OpenID Connect and OAuth2 providers. This property can be used to refer to a provider such as `github` with only a minimum number of customizations required, typically, an account specific `client id`, `client secret` and some properties have to be set to complete the configuration.
ja_jp: よく知られた OpenID Connect および OAuth2 プロバイダーを参照するために、 `quarkus.oidc.provider` 設定プロパティーが導入されました。このプロパティーを使用して、最小限のカスタマイズのみが必要な `github` などのプロバイダーを参照することができます。通常、アカウント固有の `client id`、 `client secret` およびいくつかのプロパティーを設定して設定を完了する必要があります。

source: `quarkus.oidc.provider` is a composite property. For example, when you do `quarkus.oidc.provider=github`, it is expanded into many more properties that are required to have Quarkus OIDC successfully working with the GitHub OAuth2 provider.
ja_jp: `quarkus.oidc.provider` は複合プロパティーです。たとえば、 `quarkus.oidc.provider=github` と設定すると、Quarkus OIDC が GitHub OAuth2 プロバイダーで正常に動作するために必要な、より多くのプロパティーに展開されます。

source: `quarkus.oidc.public-key` can contain an inlined public verification key and used for OIDC tests.
ja_jp: `quarkus.oidc.public-key` はインラインの公開検証鍵を含むことができ、OIDC テストに使用されます。

source: `quarkus.oidc.resolve-tenants-with-issuer` tenant resolution property allows Quarkus to iterate over all tenants configured in `application.properties` until it finds the one with a discovered or configured `issuer` property which matches the current token's issuer (`iss`) claim.
ja_jp: `quarkus.oidc.resolve-tenants-with-issuer` テナント解決プロパティーを使用すると、Quarkus は `application.properties` で設定されたすべてのテナントを反復処理し、現在のトークンの発行者 (`iss`) クレームと一致する、検出または設定された `issuer` プロパティーを持つテナントを見つけることができます。

source: `quarkus.oidc.resource-metadata.authorization-server` allows to customize an authorization server URL that will be included in the resource metadata. The `quarkus.oidc.auth-server-url` URL is included by default, however, for some cases where an OIDC proxy interposes over the actual OIDC provider, returning the OIDC proxy's URL is required instead.
ja_jp: `quarkus.oidc.resource-metadata.authorization-server` を使用すると、リソースメタデータに含まれる認可サーバー URL をカスタマイズできます。デフォルトでは `quarkus.oidc.auth-server-url` の URL が含まれますが、OIDC プロキシが実際の OIDC プロバイダーを仲介するような一部のケースでは、代わりに OIDC プロキシの URL を返すことが必要になります。

source: `quarkus.oidc.resource-metadata.enabled` property allows Quarkus OIDC to return the protected resource metadata and it is disabled by default. The reason behind it is that letting public clients see a list of authorization server(s) that the endpoint is secured with can be considered a security information leak, therefore it should only be enabled when publishing such information is considered to be safe.
ja_jp: `quarkus.oidc.resource-metadata.enabled` プロパティーは Quarkus OIDC が保護されたリソースのメタデータを返せるようにするもので、デフォルトでは無効になっています。その理由は、エンドポイントを保護している認可サーバーのリストを公開クライアントに見せることはセキュリティー情報の漏洩とみなされる可能性があるためであり、そのような情報を公開することが安全であると考えられる場合にのみ有効にすべきです。

source: `quarkus.oidc.resource-metadata.resource` can be configured as an absolute URL.
ja_jp: `quarkus.oidc.resource-metadata.resource` は絶対 URL として設定できます。

source: `quarkus.oidc.resource-metadata.resource` represents a protected resource identifier. According to the https://datatracker.ietf.org/doc/rfc9728/[OAuth2 Protected Resource Metadata] specification, it must be presented as an HTTPS-based URL in the published metadata and the structure of this URL must be aligned with the well-known URL that the client used to access the protected resource metadata.
ja_jp: `quarkus.oidc.resource-metadata.resource` は保護されたリソース識別子を表します。 https://datatracker.ietf.org/doc/rfc9728/[OAuth2 Protected Resource Metadata] 仕様に従って、公開されるメタデータ内では HTTPS ベースの URL として提示される必要があり、この URL の構造はクライアントが保護されたリソースのメタデータにアクセスするために使用した well-known URL と整合していなければなりません。

source: `quarkus.oidc.revoke-path` and `quarkus.oidc.registration-path` are currently not used directly by Quarkus OIDC. Applications xref:security-openid-connect-client-reference.adoc#revoke-access-tokens[can revoke tokens] on logout, and other security events. Applications that already work with `quarkus-oidc` can use `quarkus.oidc.registration-path` to xref:security-openid-connect-client-registration.adoc[dynamically register OIDC clients].
ja_jp: `quarkus.oidc.revoke-path` および `quarkus.oidc.registration-path` は、現在 Quarkus OIDC によって直接使用されていません。 アプリケーションはログアウトやその他のセキュリティーイベント時に xref:security-openid-connect-client-reference.adoc#revoke-access-tokens[トークンを失効させることができます] 。 `quarkus-oidc` を既に使用しているアプリケーションは、 `quarkus.oidc.registration-path` を使用して xref:security-openid-connect-client-registration.adoc[OIDC クライアントを動的に登録] できます。

source: `quarkus.oidc.runtime.OidcProviderClient` is used when a remote request to an OIDC provider is required. If introspection of the Bearer token is necessary, then `OidcProviderClient` must authenticate to the OIDC provider. For more information about supported authentication options, see the xref:security-oidc-code-flow-authentication.adoc#oidc-provider-client-authentication[OIDC provider client authentication] section in the Quarkus "OpenID Connect authorization code flow mechanism for protecting web applications" guide.
ja_jp: `quarkus.oidc.runtime.OidcProviderClient` は、OIDC プロバイダーへのリモートリクエストが必要な場合に使用されます。 ベアラートークンのイントロスペクションが必要な場合は、 `OidcProviderClient` が OIDC プロバイダーに対して認証する必要があります。 サポートされている認証オプションの詳細は、Quarkus の「Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム」ガイドの xref:security-oidc-code-flow-authentication.adoc#oidc-provider-client-authentication[OIDC プロバイダーのクライアント認証] セクションを参照してください。

source: `quarkus.oidc.runtime.OidcProviderClient` is used when a remote request to an OpenID Connect Provider has to be done. If the bearer token has to be introspected then `OidcProviderClient` has to authenticate to the OpenID Connect Provider. Please see xref:security-openid-connect-web-authentication.adoc#oidc-provider-client-authentication[OidcProviderClient Authentication] for more information about all the supported authentication options.
ja_jp: `quarkus.oidc.runtime.OidcProviderClient` は、OpenID Connect プロバイダーへのリモートリクエストを実行する必要がある場合に使用されます。Bearer Tokenを検査する必要がある場合は、 `OidcProviderClient` が OpenID Connect プロバイダーに対して認証する必要があります。サポートされているすべての認証オプションの詳細については、xref:security-openid-connect-web-authentication.adoc#oidc-provider-client-authentication[Oidc Provider Client Authentication] を参照してください。

source: `quarkus.oidc.runtime.OidcProviderClient` is used when a remote request to an OpenID Connect Provider has to be done. It has to authenticate to the OpenID Connect Provider when the authorization code has to be exchanged for the ID, access and refresh tokens, when the ID and access tokens have to be refreshed or introspected.
ja_jp: `quarkus.oidc.runtime.OidcProviderClient` は、OpenID Connect プロバイダーへのリモートリクエストが必要なときに使用されます。ID、アクセス、リフレッシュトークンに対して認可コードを交換するとき、ID やアクセストークンをリフレッシュしたりイントロスペクトするときに、OpenID Connect プロバイダーを認証する必要があります。

source: `quarkus.oidc.tenant-enabled` property can be useful even if you work with a single default OIDC tenant, for example, when the OIDC integration in the container should be activated only on the container startup.
ja_jp: `quarkus.oidc.tenant-enabled` プロパティーは、単一のデフォルト OIDC テナントを使用している場合でも、例えばコンテナー内の OIDC 統合をコンテナーの起動時にのみアクティブ化すべき場合に役立ちます。

source: `quarkus.oidc.tenant-paths` tenant resolution property can be used to restrict a given tenant to specific request paths only. Quarkus OIDC will know which tenant configuration to choose if the current request is made to one of the paths listed in the `quarkus.oidc.tenant-paths` property.
ja_jp: `quarkus.oidc.tenant-paths` テナント解決プロパティーを使用すると、特定のテナントを特定のリクエストパスのみに制限できます。現在のリクエストが `quarkus.oidc.tenant-paths` プロパティーにリストされているパスのいずれかに対して行われた場合、Quarkus OIDC はどのテナント設定を選択すべきかを判断できます。

source: `quarkus.oidc.token-cache.max-size`, `quarkus.oidc.token-cache.time-to-live` and `quarkus.oidc.token-cache.clean-up-timer-interval` are properties for managing the default token introspection and `UserInfo` cache.
ja_jp: `quarkus.oidc.token-cache.max-size`、 `quarkus.oidc.token-cache.time-to-live`、および `quarkus.oidc.token-cache.clean-up-timer-interval` は、デフォルトのトークンイントロスペクションと `UserInfo` キャッシュを管理するためのプロパティーです。
